Revit 2027 API
FabricWireType.CreateDefaultFabricWireType Method
 Creates a new FabricWireType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultFabricWireType(
	Document ADoc
)
Public Shared Function CreateDefaultFabricWireType (
	ADoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultFabricWireType(
	Document^ ADoc
)
static member CreateDefaultFabricWireType :
        ADoc : Document -> ElementId
Parameters
ADoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricWireType Class
Autodesk.Revit.DB.Structure Namespace